Tekla Open API Reference for Tekla Structures 2025
Part.Profile Property
 Gets or sets the profile of the part.
 Namespace: Tekla.Structures.Model
 Assembly: Tekla.Structures.Model (in Tekla.Structures.Model.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public Profile Profile { get; set; }
Public Property Profile As Profile
	Get
	Set
Property Value
Type: Profile
See Also
Reference
Part Class
Tekla.Structures.Model Namespace